{
  "welcome": "Welcome to my world",
  "title": [
        "Hi, I'm",
        "a Full-Stack Developer."
    ],
    "quickDescription": "With 2+ years experienced in creating scalable web applications using Node.js and modern JavaScript/TypeScript frameworks. Looking for innovation for your project? Let's work together to create unique solutions combining creativity and exceptional user experiences.",
    "myPortfolio": "My Portfolio",
    "home": "Home",
    "name": "Kismath ADELEKE",
    "about": "About",
    "contact": "Contact",
    "aboutMe": "Learn more about me",
    "blog": "Blog",
    "myResume": "My Resume",


    "projects": "Projects",
    "resume": "Resume",

    "skills": {
        "title": "Skills",
        "learnIndepentlyWithProjects": "Learn independently (with projects)",
        "praticedInCompany": "Practiced in company",
        "seeProjects": "See my projects"
      },

    "education": {
        "title": "Education",
        "items": [
            {
                "degree": "Master's degree in Computer Engineering",
                "school": "Sorbonne University",
                "location": "Paris, France",
                "year": "2024",
                "description": "Completed through a two-year apprenticeship at Bien’ici as a full-stack developer. Degree focused on  software engineering and compilation theory."
            },
            {
                "degree": "Bachelor's degree in Computer Science",
                "school": "University of Angers",
                "location": "Angers, France",
                "year": "2022",
                "description": "Developed strong foundations in software development and systems design."
            },
            {
                "degree": "High School Diploma",
                "school": "High School of Bon Berger",
                "location": "Cotonou, Benin",
                "year": "2018",
                "description": "Focused on mathematics and physics"
            }
        ]
    },

    "skillsAndExperience" : {
        "title": [
            "My",
            "Skills & Experiences"
        ],
        "description": [
          "I hold a Master's degree in Computer Engineering from Sorbonne University, completed through a two-year apprenticeship at Bien’ici as a full-stack developer. There, I developed innovative 3D digital solutions for real estate promotion.",
          "I specialize in front-end development, crafting modern, responsive websites using JavaScript, TypeScript, Vue.js, React, and HTML/CSS, while also having experience in back-end development with Node.js and Python.",
          "Proficient in database management and cloud computing, I am a quick learner who thrives on challenges and is committed to delivering clean, maintainable code and exceptional user experiences."
        ]
    },
    "allaboutMe": {
        "title": "A liltle about <span class=\"marked\">Me</span>",
        "intro": "I’m a Software Engineer located in France. I  am passionate about  UI effects and creating intuitive, dynamic user experiences.",
        "details": [
          " I thrive on challenges, tackling them with creativity and precision to deliver optimal solutions.",
          " I’m eager to work across the creative frontend spectrum, collaborating on ambitious projects with like-minded, positive people.",
          " Beyond coding, I’m deeply passionate about fitness and boxing, exploring the outdoors with friends, binge-watching top TV series, and immersing myself in English literature."
        ]
  }
}