{
    "title": "Hi, I'm Kismath, a problem solver, a dreamer, and a developer.",
    "quickDescription": "Looking to bring innovation to your next project? Let's create something great together. Showcasing diverse projects that reflect my creativity, and commitment to exceptional user experiences.",
    "myPortfolio": "My Portfolio",
    "home": "Home",
    "about": "About",
    "aboutMe": "Who am I ?",
    "blog": "Blog",
    "myResume": "My Resume",

    "projects": "Projects",
    "contact": "Contact",
    "resume": "Resume",
    "skills": "Skills",

    "skillsAndExperience" : {
        "title": [
            "My",
            "Skills & Experiences"
        ],
        "description": [
          "I hold a Master's degree in Computer Engineering from Sorbonne University, completed through a two-year apprenticeship at Bien’ici as a full-stack developer. There, I developed innovative 3D digital solutions for real estate promotion.",
          "I specialize in front-end development, crafting modern, responsive websites using JavaScript, TypeScript, Vue.js, React, and HTML/CSS, while also having experience in back-end development with Node.js and Python.",
          "Proficient in database management and cloud computing, I am a quick learner who thrives on challenges and is committed to delivering clean, maintainable code and exceptional user experiences."
        ]
    },
    "allaboutMe": {
        "title": "All About <span class=\"marked\">Myself</span>",
        "intro": "I’m a Software Engineer located in France. I have a serious passion for UI effects and creating intuitive, dynamic user experiences. User satisfaction is a must for me.",
        "details": [
        "<i class=\"fas fa-tasks\"></i> I'm a detail-oriented problem solver who loves tackling challenges with precision and creativity.",
        "<i class=\"fas fa-dumbbell\"></i> Passionate about <strong>fitness</strong> and <strong>boxing</strong>, <i class=\"fas fa-tree\"></i> enjoying <strong>adventures outdoors</strong> with friends, <i class=\"fas fa-tv\"></i> binge-watching the best <strong>TV series</strong>, and <i class=\"fas fa-book\"></i> diving into the world of <strong>English literature</strong>.",
        "And I'm interested in the entire creative frontend spectrum and working on ambitious projects with positive people."
        ]
  }
}