{
  "welcome": "Welcome to my world",
  "title": [
        "Hi, I'm",
        "a Software engineer"
    ],
    "quickDescription": "With 2+ years experienced in creating scalable web applications with modern JavaScript/TypeScript frameworks.",
    "home": "Home",
    "name": "Kismath ADELEKE",
    "about": "About",
    "contact": "Contact",
    "aboutMe": "Learn more about me",
    "blog": "Blog",
    "myResume": "My Resume",
    "allRightsReserved": "All rights reserved",
    "availableForHire": "Open to work",
    "siteName": "Kismath Adeleke",
    "downloadResume": "Download my resume",


    "projects": "Projects",
    "resume": "Resume",

    "skills": {
        "title": "Skills",
        "learnIndepentlyWithProjects": "Learn independently (with projects)",
        "praticedInCompany": "Used in company",
        "seeProjects": "See my projects"
      },

    "education": {
        "title": "Education",
        "items": [
            {
                "degree": "Master's degree in Computer Engineering",
                "school": "Sorbonne University",
                "location": "Paris, France",
                "year": "2024",
                "description": "Completed through a two-year apprenticeship at Bien’ici as a full-stack developer. Degree focused on  software engineering and compilation theory."
            },
            {
                "degree": "Bachelor's degree in Computer Science",
                "school": "University of Angers",
                "location": "Angers, France",
                "year": "2022",
                "description": "Developed strong foundations in software development and systems design."
            },
            {
                "degree": "High school diploma (Baccalaureat)",
                "school": "High School of Bon Berger",
                "location": "Cotonou, Benin",
                "year": "2018",
                "description": "Main courses: mathematics, physics and life and earth sciences"
            }
        ]
    },

    "career" : {
        "title": "Experiences",
            "items": [
              {
                "title": "Full-Stack Developer",
                "company": "Bien'ici, 2 years (2022 - 2024)",
                "location": "Paris, France",
                "context": "Development of innovative 3D digital solutions (3D plans, virtual tours, and configurable visits) to promote new real estate programs tailored to the needs of property developers.",
                "team": {
                  "title": "Team",
                  "content": "5 members (3 developers, 1 product owner, 1 product manager)"
                },
                "tools": {
                  "title": "Tools",
                  "content": "Vue.js, Express.js, Node.js, TypeScript, HTML/SCSS, Git, Jira, Jenkins, Bitbucket, AWS, Docker"
                },
                "tasks": {
                  "title": "Tasks",
                  "content": [
                    "Analyzing client requirements with stakeholders",
                    "Collaborating in an Agile environment (Kanban)",
                    "Utilizing design patterns, including dependency injection",
                    "Developing new features and ensuring the corrective and evolutive maintenance of the application",
                    "Optimizing application performance to ensure a smooth and intuitive user experience",
                    "Participating in code reviews and reverse engineering",
                    "Continuously deploying the application on AWS using Docker and Jenkins"
                  ]
                },
                "results": {
                  "title": "Results",
                  "content": [
                    "Optimized the performance of MyHabiteo Studio (a tool for exporting high-quality perspectives from any virtual or configurable visit), resulting in a 30% increase in user engagement.",
                    "Redesigned the 3D mega widget (a 3D visualization tool for real estate projects), improving user experience across all devices (mobile, tablet, desktop).",
                    "Delivered 12 configurable virtual tours, each sold at a unit price of €3,000."
                  ]
                }
              },
              {
                "title": "DevSecOps Developer",
                "company": "Tranquil IT, 4 months (2021)",
                "location": "Nantes, France",
                "context": "Automated application management using WAPT packages (deployment, updates, and removal) for the company's clients.",
                "team": {
                  "title": "Team",
                  "content": "4 developers"
                },
                "tools": {
                  "title": "Tools",
                  "content": "Python, WAPT, Git, Windows Server, Flask, SQL Server"
                },
                "tasks": {
                  "title": "Tasks",
                  "content": [
                    "Developed a Python script to automate the deployment of software packages",
                    "Collaborated with the development team to enhance application security and performance",
                    "Built a dashboard to visualize deployment data within clients' IT infrastructures"
                  ]
                },
                "results": {
                  "title": "Results",
                  "content": [
                    "Reduced manual workload by 50% through automation of software package deployments",
                    "Decreased deployment time by 40% by implementing a continuous integration pipeline"
                  ]
                }
              }
            ],
          
        "readMore": "read more...",
        "readLess": "read less..."

    },
    "contactMe": {
        "title": "Contact me",
        "description": "I'm currently looking for new opportunities and would love to hear from you. Whether you have a question or just want to say hi, feel free to send me a message.",
        "form": {
            "name": "Name",
            "email": "Email",
            "message": "Message",
            "send": "Send"
        }
    },
    "allaboutMe": {
        "title": ["A little about", " Me"],
       "intro": "Passionate developer, I am driven by creating impactful digital experiences. What sets me apart? A quick learning ability, precision in solving complex problems, and a constant drive to improve.",
    "strengths": "My strengths",
    "strengthsDetails": [
        "Design of innovative solutions: Automations and high-performing web applications.",
        "Adaptability: Tackling diverse projects in demanding technical environments.",
        "Effective collaboration: I believe in teamwork to achieve ambitious results."
    ],
    "myEngine": ["My drive", "Transforming ideas into concrete, useful, and intuitive solutions."]
  },
   "pageNotFound": {
        "title": "Look like you're lost",
        "description": "The page you are looking for is not available. Please check the URL or go back to the homepage.",
        "goToHome": "Go to Home"
   },

   "personnality": {
        "title": "Personnality as a Developer",
        "description": [
            "Slow and Steady, ",
            "Win The Rase"
        ],
        "quickLearning": {
            "title": "Quick Learning",
            "description": "Best software developers are often fantastic self-learners.The ideal skill any person can have is understanding how to learn, and ideal developers have acquired the skill of self-learning."
        },
        "problemSolving": {
            "title": "Problem Solving",
            "description": "Problem-solving is a one of the most important part of the work. Problem-solving also has to do with utilizing creativity and logical thought processes to identify problems and resolve them with software."
        },
        "admitMistakes": {
            "title": "Admit Mistakes",
            "description": "We, as software developers, need to learn to admit our mistakes. Of course, making mistakes happens to all of us.The most important thing to do is to make an effort to learn from them and try to avoid them in the future."
        }
    },

    "blogs": {
        "items":[
            {
                "title": "Behind the screen: my failures, my lessons, and my passion for code",
                "description": "An authentic and sincere journey of a developer, between learning, technical challenges, and resilience in the face of failure. Discover the lessons learned from a journey into the world of code."
            },
            {
                "title": "The battle between frontend and backend: How about we stop fighting?",
                "description": "Find out how I learned to love the frontend and the backend, and why it's time to end the war between the two."
            }

        ],
        "readMore": "Read more"
    },

    "projectsPage": {
        "liveDemo": "Live Demo",
        "sourceCode": "Source Code",
        "items": [
            {
                "title": "Clock Manager App",
                "description": "A simple clock manager app that allows you to add, edit, and delete clocks for different time zones. The goal was to create a modular application while applying the MVC (Model-View-Controller) architectural pattern"
            },
            {
                "title": "Birthday personnalized wish App",
                "description": "Birthday personnalized wish App to send birthday wishes to your loved ones. The goal was to create a fun and interactive using React"
            },
            {
                "title": "Password Generator",
                "description": "A simple password generator that allows you to generate a random password based on your preferences. The goal was to create a simple, user-friendly application using vanilla JavaScript."
            },
            {
                "title": "Personal Portfolio",
                "description": "A personal portfolio website that showcases my projects, skills, and experience. The goal was to create a visually appealing, responsive website using HTML, CSS, and JavaScript."
            },
            {
                "title": "Checkers game",
                "description": "A simple checkers game with another player. The goal was to create a desktop game using Qt and C++."
            }
        ]
    },

    "contactPage": {
        "title": "Contact",
        "description": "I'm currently looking for new opportunities and would love to hear from you. Whether you have a question or just want to say hi, feel free to send me a message.",
        "form": {
            "name": "Your Full Name",
            "email": "Your Email",
            "subject": "Subject",
            "message": "Your Message",
            "send": "Send Message",
            "success": ["Your message has been sent successfully, "," I will get back to you as soon as possible."]
        }
    }

    

}