{
  "welcome": "Bienvenue dans mon monde",
  "title": ["Bonjour, je suis", "une Ingénieure Logiciel"],
  "quickDescription": "Avec plus de 2 ans d'expérience dans la création d'applications web évolutives en utilisant des frameworks JavaScript/TypeScript modernes. ",
  "myPortfolio": "Mon Portfolio",
  "home": "Accueil",
  "name": "Kismath ADELEKE",
  "about": "À propos",
  "aboutMe": "Qui suis-je ?",
  "blog": "Blog",
  "myResume": "Mon CV",
  "allRightsReserved": "Tous droits réservés",
  "downloadResume": "Télécharger mon CV",

  "projects": "Projets",
  "contact": "Contact",
  "resume": "CV",
  "skills": {
    "title": "Compétences",
    "learnIndepentlyWithProjects": "Apprentissage en autonomie (avec des projets)",
    "praticedInCompany": "Utilisés en entreprise",
    "seeProjects": "Voir mes projets"
  },
  "availableForHire": "Ouvert à l'emploi",

  "education": {
    "title": "Education",
    "items": [
      {
        "degree": "Master Informatique",
        "school": "Sorbonne Université ",
        "location": "Paris, France",
        "year": "2024",
        "description": "Obtenu en apprentissage de deux ans chez Bien'ici en tant que développeuse full-stack. Le diplôme est axé sur l'ingénierie logicielle et la théorie de la compilation."
      },
      {
        "degree": "Licence  Informatique",
        "school": "Université d'Angers",
        "location": "Angers, France",
        "year": "2022",
        "description": "Acquisition des bases solides en développement logiciel et en conception de systèmes."
      },
      {
        "degree": "Baccalauréat",
        "school": "Lycée du Bon Berger",
        "location": "Cotonou, Bénin",
        "year": "2018",
        "description": "Cours principaux  : mathématiques, physique et sciences de la vie et de la terre"
      }
    ]
  },

  "career" : {
    "title": "Expériences",
    "items": [
        {
            "title": "Développeur Full-Stack",
            "company": "Bien'ici, 2 ans (2022 - 2024)",
            "location": "Paris, France",
            "context": "Développement de solutions numériques 3D innovantes (plans 3D, visites virtuelles et configurables, etc.) pour promouvoir les programmes immobiliers dans le neuf à la demande des promoteurs en fonction de leurs besoins.",
            "team": {
                "title": "Equipe",
                "content": "5 personnes (3 développeurs, 1 product owner, 1 product manager)"
            } ,
            
            "tools": {
                 "title": "Outils",
                "content":  "Vue.js, Express.js, Node.js, TypeScript, HTML/SCSS, Git, Jira, Jenkins, Bitbucket, AWS, Docker"

            },
            "tasks": {
                "title": "Tâches",
                "content":  [
                    "Analyse des besoins du client avec les parties prenantes",
                    "Travail en collaboration dans un environnement Agile (Kanban)",
                    "Utilisation des design patterns, incluant l'injection de dépendances",
                    "Développement de nouvelles fonctionnalités, en assurant la maintenance corrective et évolutive de l'application",
                    "Optimisation des performances de l'application, en assurant une expérience utilisateur fluide et intuitive",
                    "Participation à la revue de code et à la rétro-ingénierie",
                    "Déploiement continu de l'application sur AWS, en utilisant Docker et Jenkins"
    
                ]
            },
            "results": {
                "title": "Resultats",
                "content": [
                    "Optimisation des performances de myHabiteo Studio (un outil pour exporter des perspectives de haute qualité à partir de n’importe quelle visite virtuelle ou configurable, permettant de promouvoir les programmes immobiliers à moindre coût, entraînant une augmentation de 30 % de l'engagement des utilisateurs. ",
                    "Refonte du méga widget 3D (un outil de visualisation 3D pour les projets immobiliers, permettant aux utilisateurs d'explorer les propriétés dans un environnement virtuel), pour ameliorer l'expérience utilisateur sur tout les supports (mobile, tablette, desktop)", 
                    "Livraisons de 12 visites configurables, chacune étant vendue à un prix unitaire de 3 000"     
                ]
            } 
        
        },
        {
            "title": "Développeur DevSecOps",
            "company": "Tranquil IT, 4 mois (2021)",
            "location": "Nantes, France",
            "context": "Automatisation de la gestion des applications avec des packages WAPT (déploiement, mises à jour et suppression) pour les clients de l'entreprise.",
            "team": {
                "title": "Equipe",
                "content": "4 développeurs "
            } ,
            "tools": {
                "title": "Outils",
                "content":  "Python, WAPT, Git, Windows Server, Flask, SQL Server"
            },
            "tasks": {
                "title": "Tâches",
                "content":  [
                    "Développement d'un script Python pour automatiser le déploiement des packages logiciels",
                    "Collaboration avec l'équipe de développement pour améliorer la sécurité et les performances des applications",
                    "Developpement d'un tableau de bord pour la visualisation des données de déploiement dans le parc informatique des clients"
                ]
            },
            "results": {
                "title": "Resultats",
                "content": [
                    "Reeduction de la charge de travail manuelle de 50% grâce à l'automatisation du déploiement des packages logiciels",
                    "Réduction de 40% du temps de déploiement grâce à la mise en place d'un pipeline d'intégration continue"
                ]
            }
        }
    ],
    "readMore": "lire la suite...",
    "readLess": "lire moins..."
},

  "allaboutMe": {
    "title": ["Quelques mots sur", " Moi"],
    "intro": "Développeuse passionnée, je suis animée par la création d’expériences numériques impactantes. Ce qui me distingue ? Une capacité à apprendre rapidement, une rigueur dans la résolution de problèmes complexes et une soif de toujours faire mieux.",
    "strengths": "Mes forces",
    "strengthsDetails":  [
      "Conception de solutions innovantes : Automatisations et applications web performantes.",
      "Adaptabilité : des missions variées dans des environnements techniques exigeants.",
      "Collaboration efficace : je crois au travail d’équipe pour atteindre des résultats ambitieux."
    ],
    "myEngine": ["Mon moteur","Transformer les idées en solutions concrètes, utiles et intuitives."]

  },

  "blogs": {
    "items": [
        {
            "title": "Derrière l'écran : mes échecs, mes leçons, et ma passion du code",
            "description": "Un parcours authentique et sincère d'une développeuse, entre apprentissage, défis techniques, et résilience face aux échecs. Découvrez les leçons tirées d'un voyage dans le monde du code."
        },
        {
            "title": "La bataille entre le frontend et le backend : Et si on arrêtait de s'acharner ?",
            "description": "Découvrez comment j'ai appris à aimer le frontend et le backend, et pourquoi il est temps de mettre fin à la guerre entre les deux."
        },
        {
            "title": "Maîtrise des outils (langages et frameworks) ou des fondamentaux en programmation : Où placer la priorité ?",
            "description": "Une réflexion sur l'importance de maîtriser les fondamentaux de la programmation avant de plonger dans le monde des langages et des frameworks."
        }
    ],
    "readMore": "Lire plus"
  },

  "pageNotFound": {
    "title": "On dirait que vous êtes perdu...",
    "description": "La page que vous recherchez n'est pas disponible. Vous pouvez revenir à la page d'accueil ou explorer d'autres sections de mon site.",
    "goToHome": "Retour à l'accueil"
  },

  "personnality": {
    "title": "Personnalité en tant que Développeur",
    "description": ["Lentement mais surement,",
            "on réussit"],
    "quickLearning": {
      "title": "Apprentissage Rapide",
      "description": "Les meilleurs développeurs de logiciels sont souvent des autodidactes fantastiques. La compétence idéale que toute personne peut avoir est de comprendre comment apprendre, et les développeurs idéaux ont acquis la compétence de l'auto-apprentissage."
    },
    "problemSolving": {
      "title": "Résolution de Problèmes",
      "description": "La résolution de problèmes est l'une des parties les plus importantes du travail. La résolution de problèmes consiste également à utiliser la créativité et les processus de pensée logique pour identifier les problèmes et les résoudre avec des logiciels."
    },
    "admitMistakes": {
      "title": "Admettre ses erreurs",
      "description": "Nous, en tant que développeurs de logiciels, devons apprendre à admettre nos erreurs. Bien sûr, faire des erreurs arrive à tout le monde. La chose la plus importante à faire est de faire un effort pour apprendre de ces erreurs et essayer de les éviter à l'avenir."
    }
  },
  "projectsPage": {
    "liveDemo": "Démo",
    "sourceCode": "Code source",
    "time": "Durée",
    "whatDidILearn": "Ce que j'ai appris",
    
    "items": [
        {
            "title": "Application de Gestion d'Horloge",
            "description": "Une application de gestion d'horloges qui vous permet d'ajouter, de modifier et de supprimer des horloges pour différents fuseaux horaires. L'objectif était de créer une application modulaire tout en appliquant le modèle architectural MVC (Modèle-Vue-Contrôleur) ",
            "time": "+ 100 heures",
            "learn": "J'ai appris à utiliser le modèle architectural MVC pour créer une application modulaire. J'ai également appris à utiliser les principes SOLID (comme le principe ouvert/fermé, le principe de substitution de Listkov, le principe d'inversion de dépendance) et le modèle de publication/abonnement pour créer une application évolutive et facile à maintenir."
        },
        {
            "title": "Application de Vœux Personnalisés d'Anniversaire",
            "description": "Une application de vœux personnalisés d'anniversaire pour envoyer des vœux d'anniversaire à vos proches. L'objectif était de créer une application amusante et interactive en utilisant React.",
            "time": "+ 150 heures",
            "learn": "J'ai appris à travailler avec les composants, les accessoires et l'état de React pour créer une interface utilisateur dynamique qui se met à jour en temps réel. J'ai également appris à utiliser React Router pour créer une application multipage et gérer l'état de l'application à l'aide de React Context."
        },
        {
            "title": "Générateur de Mot de Passe",
            "description": "Un générateur de mot de passe simple qui vous permet de générer un mot de passe aléatoire en fonction de vos préférences. L'objectif était de créer une application simple et conviviale en utilisant JavaScript vanilla.",
            "time": "+ 10 heures",
            "learn": "J'ai appris à travailler avec des récepteurs d'événements, à manipuler le DOM et à utiliser des instructions conditionnelles pour créer une interface utilisateur interactive."
        },
        {
            "title": "Portfolio Personnel",
            "description": "Un site web de portfolio personnel qui présente mes projets, compétences et expériences. L'objectif était de créer un site web visuellement attrayant et réactif en utilisant HTML, CSS et JavaScript.",
            "time": "+ 250 heures",
            "learn": "J'ai appris à utiliser Vuejs pour créer un site web visuellement attrayant et réactif. J'ai également appris à utiliser CSS Grid et Flexbox pour créer une mise en page flexible qui s'adapte à différentes tailles d'écran et d'appareils. Enfin, j'ai appris à gérer le référencement et l'accessibilité pour améliorer la visibilité et la convivialité du site web."
        },
        {
            "title": "Jeu de dames",
            "description": "Un jeu de dames avec un autre joueur. L'objectif était de créer un jeu de bureau en utilisant Qt et C++.",
            "time": "+ 70 heures",
            "learn": "J'ai appris à utiliser Qt et C++ pour créer un jeu de bureau. J'ai également appris à travailler avec le framework Qt pour créer une interface utilisateur graphique et gérer les événements d'entrée de l'utilisateur afin de créer une expérience de jeu interactive."

        }

        ]
  },

  "contactPage": {
    "title": "Contactez-moi",
    "description": "Je suis actuellement à la recherche de nouvelles opportunités et j'aimerais avoir de vos nouvelles. Que vous ayez une question ou que vous vouliez simplement dire bonjour, n'hésitez pas à m'envoyer un message.",
    "form": {
        "name": "Votre Nom Complet",
        "email": "Votre Email",
        "subject": "Sujet",
        "message": "Votre Message",
        "send": "Envoyer le Message",
        "success": ["Votre message a été envoyé avec succès,", "Je vous répondrai dès que possible."]
    }
}
}
